MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK20DX32VLF5/mcu.h
#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry ::


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_CRC register.
//
//*****************************************************************************

#define HU                            0x7F80000000      // CRC High Upper Byte
#define HL                            0x7F800000      // CRC High Lower Byte
#define LU                            0x007F8000      // CRC Low Upper Byte
#define LL                            0x00007F80      // CRC Low Lower Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_GPOLY register.
//
//*****************************************************************************

#define HIGH                          0x7FFF80000000      // High Polynominal Half-word
#define LOW                           0x7FFF8000      // Low Polynominal Half-word


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_CTRL register.
//
//*****************************************************************************

#define TOT                           0x180000000      // Type Of Transpose For Writes
#define TOTR                          0x60000000      // Type Of Transpose For Read
#define FXOR                          0x04000000      // Complement Read Of CRC Data Register
#define WAS                           0x02000000      // Write CRC Data Register As Seed


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_SC1n register.
//
//*****************************************************************************

#define COCO                          0x00000080      // Conversion complete flag
#define AIEN                          0x00000040      // Interrupt enable
#define DIFF                          0x00000020      // Differential mode enable
#define ADCH                          0x000001F0      // Input channel select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CFG1 register.
//
//*****************************************************************************

#define ADLPC                         0x00000080      // Low-power configuration
#define ADIV                          0x000000C0      // Clock divide select
#define ADLSMP                        0x00000010      // Sample time configuration
#define MODE                          0x00000018      // Conversion mode selection
#define ADICLK                        0x00000006      // Input clock select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CFG2 register.
//
//*****************************************************************************

#define MUXSEL                        0x00000010      // ADC Mux select
#define ADACKEN                       0x00000008      // Asynchronous clock output enable
#define ADHSC                         0x00000004      // High speed configuration
#define ADLSTS                        0x00000006      // Long sample time select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_Rn register.
//
//*****************************************************************************

#define D                             0x7FFF8000      // Data result ::


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CVn register.
//
//*****************************************************************************

#define CV                            0x7FFF8000      // Compare value ::


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_SC2 register.
//
//*****************************************************************************

#define ADACT                         0x00000080      // Conversion active
#define ADTRG                         0x00000040      // Conversion trigger select
#define ACFE                          0x00000020      // Compare function enable
#define ACFGT                         0x00000010      // Compare function greater than enable
#define ACREN                         0x00000008      // Compare function range enable
#define DMAEN                         0x00000004      // DMA enable
#define REFSEL                        0x00000006      // Voltage reference selection


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_SC3 register.
//
//*****************************************************************************

#define CAL                           0x00000080      // Calibration
#define CALF                          0x00000040      // Calibration failed flag
#define ADCO                          0x00000008      // Continuous conversion enable
#define AVGE                          0x00000004      // Hardware average enable
#define AVGS                          0x00000006      // Hardware average select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_OFS register.
//
//*****************************************************************************

#define OFS                           0x7FFF8000      // Offset error correction value ::


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_PG register.
//
//*****************************************************************************

#define PG                            0x7FFF8000      // Plus-side gain ::


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_MG register.
//
//*****************************************************************************

